# missing data 
### finding the missing data 
### removing 
### filling

In [2]:
import numpy as np
import pandas as pd

In [10]:
data = {

    'name':['anshu','aman',np.nan,'anu'],
    'age':[23,25,25,28]
}
labels=[1,2,3,4]

In [11]:
df=pd.DataFrame(data,index=labels)

In [12]:
df

    name  age
1  anshu   23
2   aman   25
3    NaN   25
4    anu   28

In [13]:
df.isna()

    name    age
1  False  False
2  False  False
3   True  False
4  False  False

In [14]:
df.isna().sum()

name    1
age     0
dtype: int64

In [15]:
df.isna().any()

name     True
age     False
dtype: bool

In [16]:
df

    name  age
1  anshu   23
2   aman   25
3    NaN   25
4    anu   28

### removing the nan value works on the basis of the rows

In [17]:
df.dropna()

    name  age
1  anshu   23
2   aman   25
4    anu   28

In [18]:
df

    name  age
1  anshu   23
2   aman   25
3    NaN   25
4    anu   28

In [22]:
df.dropna(thresh=0)

    name  age
1  anshu   23
2   aman   25
3    NaN   25
4    anu   28

### filling the missing data

In [23]:
df

    name  age
1  anshu   23
2   aman   25
3    NaN   25
4    anu   28

In [34]:
df.fillna(value='aman')

    name  age
1  anshu   23
2   aman   25
3   aman   25
4    anu   28